README.tex
% Created 2025-04-07 Mon 22:49
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Aksel Olav Steen}
\date{\today}
\title{Muh Dotfiles}
\hypersetup{
 pdfauthor={Aksel Olav Steen},
 pdftitle={Muh Dotfiles},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 31.0.50 (Org mode 9.7.27)}, 
 pdflang={English}}

% Setup for code blocks [1/2]

\usepackage{fvextra}

\fvset{%
  commandchars=\\\{\},
  highlightcolor=white!95!black!80!blue,
  breaklines=true,
  breaksymbol=\color{white!60!black}\tiny\ensuremath{\hookrightarrow}}

% Make line numbers smaller and grey.
\renewcommand\theFancyVerbLine{\footnotesize\color{black!40!white}\arabic{FancyVerbLine}}

\usepackage{xcolor}

% In case engrave-faces-latex-gen-preamble has not been run.
\providecolor{EfD}{HTML}{f7f7f7}
\providecolor{EFD}{HTML}{28292e}

% Define a Code environment to prettily wrap the fontified code.
\usepackage[breakable,xparse]{tcolorbox}
\DeclareTColorBox[]{Code}{o}%
{colback=EfD!98!EFD, colframe=EfD!95!EFD,
  fontupper=\footnotesize\setlength{\fboxsep}{0pt},
  colupper=EFD,
  IfNoValueTF={#1}%
  {boxsep=2pt, arc=2.5pt, outer arc=2.5pt,
    boxrule=0.5pt, left=2pt}%
  {boxsep=2.5pt, arc=0pt, outer arc=0pt,
    boxrule=0pt, leftrule=1.5pt, left=0.5pt},
  right=2pt, top=1pt, bottom=0.5pt,
  breakable}

% Support listings with captions
\usepackage{float}
\floatstyle{plain}
\newfloat{listing}{htbp}{lst}
\newcommand{\listingsname}{Listing}
\floatname{listing}{\listingsname}
\newcommand{\listoflistingsname}{List of Listings}
\providecommand{\listoflistings}{\listof{listing}{\listoflistingsname}}


% Setup for code blocks [2/2]: syntax highlighting colors

\newcommand\efstrut{\vrule height 2.1ex depth 0.8ex width 0pt}
\definecolor{EFD}{HTML}{37474F}
\definecolor{EfD}{HTML}{FFFFFF}
\newcommand{\EFD}[1]{\textcolor{EFD}{#1}} % default
\definecolor{EFh}{HTML}{90A4AE}
\newcommand{\EFh}[1]{\textcolor{EFh}{#1}} % shadow
\definecolor{EFsc}{HTML}{673AB7}
\newcommand{\EFsc}[1]{\textcolor{EFsc}{#1}} % success
\definecolor{EFw}{HTML}{FFAB91}
\newcommand{\EFw}[1]{\textcolor{EFw}{#1}} % warning
\definecolor{EFe}{HTML}{FF6F00}
\newcommand{\EFe}[1]{\textcolor{EFe}{#1}} % error
\definecolor{EFc}{HTML}{90A4AE}
\newcommand{\EFc}[1]{\textcolor{EFc}{#1}} % font-lock-comment-face
\definecolor{EFcd}{HTML}{90A4AE}
\newcommand{\EFcd}[1]{\textcolor{EFcd}{#1}} % font-lock-comment-delimiter-face
\definecolor{EFs}{HTML}{90A4AE}
\newcommand{\EFs}[1]{\textcolor{EFs}{#1}} % font-lock-string-face
\definecolor{EFd}{HTML}{90A4AE}
\newcommand{\EFd}[1]{\textcolor{EFd}{#1}} % font-lock-doc-face
\definecolor{EFm}{HTML}{673AB7}
\newcommand{\EFm}[1]{\textcolor{EFm}{#1}} % font-lock-doc-markup-face
\definecolor{EFk}{HTML}{673AB7}
\newcommand{\EFk}[1]{\textcolor{EFk}{#1}} % font-lock-keyword-face
\definecolor{EFb}{HTML}{673AB7}
\newcommand{\EFb}[1]{\textcolor{EFb}{#1}} % font-lock-builtin-face
\definecolor{EFf}{HTML}{263238}
\newcommand{\EFf}[1]{\textcolor{EFf}{\textbf{#1}}} % font-lock-function-name-face
\definecolor{EFv}{HTML}{263238}
\newcommand{\EFv}[1]{\textcolor{EFv}{\textbf{#1}}} % font-lock-variable-name-face
\definecolor{EFt}{HTML}{673AB7}
\newcommand{\EFt}[1]{\textcolor{EFt}{#1}} % font-lock-type-face
\definecolor{EFo}{HTML}{673AB7}
\newcommand{\EFo}[1]{\textcolor{EFo}{#1}} % font-lock-constant-face
\definecolor{EFwr}{HTML}{FFAB91}
\newcommand{\EFwr}[1]{\textcolor{EFwr}{#1}} % font-lock-warning-face
\newcommand{\EFnc}[1]{#1} % font-lock-negation-char-face
\definecolor{EFpp}{HTML}{673AB7}
\newcommand{\EFpp}[1]{\textcolor{EFpp}{#1}} % font-lock-preprocessor-face
\definecolor{EFrc}{HTML}{263238}
\newcommand{\EFrc}[1]{\textcolor{EFrc}{\textbf{#1}}} % font-lock-regexp-grouping-construct
\definecolor{EFrb}{HTML}{263238}
\newcommand{\EFrb}[1]{\textcolor{EFrb}{\textbf{#1}}} % font-lock-regexp-grouping-backslash
\definecolor{Efob}{HTML}{FAFAFA}
\newcommand{\EFob}[1]{\colorbox{Efob}{\efstrut{}#1}} % org-block
\newcommand{\EFhn}[1]{#1} % highlight-numbers-number
\newcommand{\EFhq}[1]{#1} % highlight-quoted-quote
\newcommand{\EFhs}[1]{#1} % highlight-quoted-symbol
\definecolor{EFrda}{HTML}{707183}
\newcommand{\EFrda}[1]{\textcolor{EFrda}{#1}} % rainbow-delimiters-depth-1-face
\definecolor{EFrdb}{HTML}{7388d6}
\newcommand{\EFrdb}[1]{\textcolor{EFrdb}{#1}} % rainbow-delimiters-depth-2-face
\definecolor{EFrdc}{HTML}{909183}
\newcommand{\EFrdc}[1]{\textcolor{EFrdc}{#1}} % rainbow-delimiters-depth-3-face
\definecolor{EFrdd}{HTML}{709870}
\newcommand{\EFrdd}[1]{\textcolor{EFrdd}{#1}} % rainbow-delimiters-depth-4-face
\definecolor{EFrde}{HTML}{907373}
\newcommand{\EFrde}[1]{\textcolor{EFrde}{#1}} % rainbow-delimiters-depth-5-face
\definecolor{EFrdf}{HTML}{6276ba}
\newcommand{\EFrdf}[1]{\textcolor{EFrdf}{#1}} % rainbow-delimiters-depth-6-face
\definecolor{EFrdg}{HTML}{858580}
\newcommand{\EFrdg}[1]{\textcolor{EFrdg}{#1}} % rainbow-delimiters-depth-7-face
\definecolor{EFrdh}{HTML}{80a880}
\newcommand{\EFrdh}[1]{\textcolor{EFrdh}{#1}} % rainbow-delimiters-depth-8-face
\definecolor{EFrdi}{HTML}{887070}
\newcommand{\EFrdi}[1]{\textcolor{EFrdi}{#1}} % rainbow-delimiters-depth-9-face
\begin{document}

\maketitle
\section{Introduction}
\label{sec:org4c50468}
This are my dotfiles, there are many like them, but these are mine. My
dotfiles is my best friend. It is my life. \\

Hosts are split into 3 categories:
\begin{itemize}
\item \href{./hosts/sinnoh/README.org}{Sinnoh}: Arch/Arch-like systems
\begin{itemize}
\item Usernames: Gen IV pokemon
\end{itemize}
\item \href{./hosts/kalos/README.org}{Kalos}: Darwin systems
\begin{itemize}
\item Usernames: Gen VI pokemon
\end{itemize}
\item \href{./hosts/johto/README.org}{Johto}: NixOS systems
\begin{itemize}
\item Usernames: Gen II pokemon
\end{itemize}
\end{itemize}
\section{Steps to install}
\label{sec:orgb7b73e4}

\begin{enumerate}
\item Install Nix
\begin{Code}
\begin{Verbatim}
\color{EFD}sh <\EFrda{(}curl -L https://nixos.org/nix/install\EFrda{)}
\end{Verbatim}
\end{Code}

\item Clone this repo
\begin{Code}
\begin{Verbatim}
\color{EFD}git clone --recurse-submodules https://github.com/aksel-os/.dotfiles.git    
\end{Verbatim}
\end{Code}

\texttt{-{}-{}recurse-submodules} will also clone my emacs repo.

\item cd into \texttt{.dotfiles}
\begin{Code}
\begin{Verbatim}
\color{EFD}\EFb{cd} \char126{}/.dotfiles/
\end{Verbatim}
\end{Code}

\item Change placeholders in \texttt{flake.nix} and \texttt{.envrc}
\begin{Code}
\begin{Verbatim}
\color{EFD}sed -i \EFs{''} -e \EFs{'s/ARCHITECTURE/your\_architecture/g'} -e \EFs{'s/HOSTNAME/your\_hostname/g'} -e \EFs{'s/USERNAME/your\_username/g'} flake.nix
sed -i \EFs{''} -e \EFs{'s/USERNAME/your\_username/g'} -e \EFs{'s/HOSTNAME/your\_hostname/g'} .envrc
\end{Verbatim}
\end{Code}

Note: mac requires and empty string for \texttt{-i}, if you're on linux you should
remove the empty string

\item Build the flake
\begin{Code}
\begin{Verbatim}
\color{EFD}make system \EFv{arg}=nixos or darwin
make home \EFv{TRAINER\_USER\_PROFILE}=\EFs{"your\_username"}
\end{Verbatim}
\end{Code}
\end{enumerate}
\section{Updating}
\label{sec:orga5dcb94}

After making any changes to the user level modules, run
\begin{Code}
\begin{Verbatim}
\color{EFD}make home
\end{Verbatim}
\end{Code}

Changes at the system level will require you to run
\begin{Code}
\begin{Verbatim}
\color{EFD}make system \EFv{arg}=nixos or darwin
\end{Verbatim}
\end{Code}

To update the flake.lock run the following:
\begin{Code}
\begin{Verbatim}
\color{EFD}make update
\end{Verbatim}
\end{Code}

\begin{HTML}
<div class="note">
Both \texttt{system} and \texttt{home} has \texttt{update} as a dependency. To run \texttt{system} or \texttt{home}
without \texttt{update} you should append the \texttt{-o} flag, e.g. \texttt{make -o home}. 
</div>
\end{HTML}
\section{Future plans}
\label{sec:org009df0e}
Make a cli like GUIX to manage things. Inspired by librephoenix and hlissner's dotfiles
\end{document}
